/**
 * @Description: 正则表达式验证规则
 * @Author XuJun
 * @Date 2019/8/31
 */

export const Regexp = {
  // 小写字母
  LOWER_CASE: /^[a-z]+$/,
  // 大写字母
  UPPER_CASE: /^[A-Z]+$/,
  // 纯字母
  ALPHABET: /^[A-Za-z]+$/,
  // 纯字母+数字
  ALPHANUM: /^[A-Za-z0-9]+$/,
  // url
  URL: /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/,
  // Phone
  PHONE: /^1\d{10}$/,
  // 手机号 | 座机号
  PHONE_NUM: /^((0[0-9]{2,3}-)+([0-9]{7,8})+(-[0-9]{1,4})?$)|((1\d{10})$)/,
  // 座机号
  PHONE_FIXED: /^((0[0-9]{2,3}-)+([0-9]{7,8})+(-[0-9]{1,4})?$)/,
  INTEGER_POSITIVE: /^[0-9]*$/,
  //非负整数的正则表达式(包括0)
  INTEGER_NONNEGATIVE: /^([0]|[1-9][0-9]*)$/,
  // 2位小数
  FLOAT_2: /^(-)?(0|[1-9]\d*)(\s|$|\.\d{1,2}\b)/,
  // 正浮点数，最多2位小数
  FLOAT_POSITION_2: /^(?!0+(?:\.0+)?$)(?:[1-9]\d*|0)(?:\.\d{1,2})?$/,
  // 非负浮点数，最多2位小数
  FLOAT_NON_NEGATIVE_2: /^(0|[1-9]\d*)(\s|$|\.\d{1,2}\b)$/,
  // 工资发放 允许空行和数字
  SALARY: /^\s*$|(?!0+(?:\.0+)?$)(?:[1-9]\d*|0)(?:\.\d{1,2})?$/,
};
